# Основной исполняемый файл
BINARY_NAME=yrestapi

# Точка входа приложения
MAIN_PACKAGE=./cmd

# ================================================
# make run — запуск приложения
run:
	@echo "▶️  Запуск приложения..."
	go run $(MAIN_PACKAGE)

# ================================================
# make build — сборка приложения
build:
	@echo "▶️  Сборка $(BINARY_NAME)..."
	go build -o $(BINARY_NAME) $(MAIN_PACKAGE)

# ================================================
# make tidy — управление зависимостями
tidy:
	@echo "▶️  Очистка и установка зависимостей..."
	go mod tidy

# ================================================
# make deps — установка зависимостей вручную
deps:
	@echo "▶️  Установка зависимостей..."
	go get ./...

# ================================================
# make watch — live reload (требуется air)
watch:
	@echo "▶️  Запуск live reload..."
	air

# ================================================
# make test — запуск тестов
test:
	@echo "▶️  Запуск тестов..."
	go test -v ./...

# ================================================
# make clean — очистка скомпилированных файлов
clean:
	@echo "▶️  Очистка скомпилированных файлов..."
	rm -f $(BINARY_NAME)